import React from 'react'
import { Link } from 'react-router-dom'

const Chalisa = () => {
  return (
    <div className="container text-center my-5">
      <p class="text-primary">
           <h2 class="mb-4">हनुमान चालीसा</h2>
              श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि। <br />
              बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि।। <br />
              बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार। <br />
              बल बुद्धि बिद्या देहु मोहिं, हरहु कलेस बिकार।। <br /> <br />
              चौपाई : <br /> <br />
              जय हनुमान ज्ञान गुन सागर। <br />
              जय कपीस तिहुं लोक उजागर।। <br /> <br />
              रामदूत अतुलित बल धामा। <br />
              अंजनि-पुत्र पवनसुत नामा।। <br /> <br />
              महाबीर बिक्रम बजरंगी। <br />
              कुमति निवार सुमति के संगी।। <br /> <br />
              कंचन बरन बिराज सुबेसा। <br />
              कानन कुंडल कुंचित केसा।। <br /> <br />
              हाथ बज्र औ ध्वजा बिरा <br />
              जै। कांधे मूंज जनेऊ साजै।। <br /> <br />
              संकर सुवन केसरीनंदन। <br />
              तेज प्रताप महा जग बन्दन।। <br /> <br />
              विद्यावान गुनी अति चातुर। <br />
              राम काज करिबे को आतुर।। <br /> <br />
              प्रभु चरित्र सुनिबे को रसिया। <br />
              राम लखन सीता मन बसिया।। <br /> <br />
              सूक्ष्म रूप धरि सियहिं दिखावा। <br />
              बिकट रूप धरि लंक जरावा।। <br /> <br />
              भीम रूप धरि असुर संहारे। <br />
              रामचंद्र के काज संवारे।। <br /> <br />
              लाय सजीवन लखन जियाये। <br />
              श्रीरघुबीर हरषि उर लाये।। <br /> <br />
              रघुपति कीन्ही बहुत बड़ाई। <br />
              तुम मम प्रिय भरतहि सम भाई।। <br /> <br />
              सहस बदन तुम्हरो जस गावैं। <br />
              अस कहि श्रीपति कंठ लगावैं।। <br /> <br />
              सनकादिक ब्रह्मादि मुनीसा। <br />
              नारद सारद सहित अहीसा।। <br /> <br />
              जम कुबेर दिगपाल जहां ते। <br />
              कबि कोबिद कहि सके कहां ते।। <br /> <br />
              तुम उपकार सुग्रीवहिं कीन्हा। <br />
              राम मिलाय राज पद दीन्हा।। <br /> <br />
              तुम्हरो मंत्र बिभीषन माना। <br />
              लंकेस्वर भए सब जग जाना।। <br /> <br />
              जुग सहस्र जोजन पर भानू। <br />
              लील्यो ताहि मधुर फल जानू।। <br /> <br />
              प्रभु मुद्रिका मेलि मुख माहीं। <br />
              जलधि लांघि गये अचरज नाहीं।। <br /> <br />
              दुर्गम काज जगत के जेते। <br />
              सुगम अनुग्रह तुम्हरे तेते।। <br /> <br />
              राम दुआरे तुम रखवारे। <br />
              होत न आज्ञा बिनु पैसारे।। <br /> <br />
              सब सुख लहै तुम्हारी सरना। <br />
              तुम रक्षक काहू को डर ना।। <br /> <br />
              आपन तेज सम्हारो आपै। <br />
              तीनों लोक हांक तें कांपै।। <br /> <br />
              भूत पिसाच निकट नहिं आवै। <br />
              महाबीर जब नाम सुनावै।। <br /> <br />
              नासै रोग हरै सब पीरा। <br />
              जपत निरंतर हनुमत बीरा।। <br /> <br />
              संकट तें हनुमान छुड़ावै। <br />
              मन क्रम बचन ध्यान जो लावै।। <br /> <br />
              सब पर राम तपस्वी राजा। <br />
              तिन के काज सकल तुम साजा। <br /> <br />
              और मनोरथ जो कोई लावै। <br />
              सोइ अमित जीवन फल पावै।। <br /> <br />
              चारों जुग परताप तुम्हारा। <br />
              है परसिद्ध जगत उजियारा।। <br /> <br />
              साधु-संत के तुम रखवारे। <br />
              असुर निकंदन राम दुलारे।। <br /> <br />
              अष्ट सिद्धि नौ निधि के दाता। <br />
              अस बर दीन जानकी माता।। <br /> <br />
              राम रसायन तुम्हरे पासा। <br />
              सदा रहो रघुपति के दासा।। <br /> <br />
              तुम्हरे भजन राम को पावै। <br />
              जनम-जनम के दुख बिसरावै।। <br /> <br />
              अन्तकाल रघुबर पुर जाई। <br />
              जहां जन्म हरि-भक्त कहाई।। <br /> <br />
              और देवता चित्त न धरई। <br />
              हनुमत सेइ सर्ब सुख करई।। <br /> <br />
              संकट कटै मिटै सब पीरा। <br />
              जो सुमिरै हनुमत बलबीरा।। <br /> <br />
              जै जै जै हनुमान गोसाईं। <br />
              कृपा करहु गुरुदेव की नाईं।। <br /> <br />
              जो सत बार पाठ कर कोई। <br />
              छूटहि बंदि महा सुख होई।। <br /> <br />
              जो यह पढ़ै हनुमान चालीसा <br />
              । होय सिद्धि साखी गौरीसा।। <br />
              <br />
              तुलसीदास सदा हरि चेरा। <br />
              कीजै नाथ हृदय मंह डेरा।। <br /> <br />
              दोहा : <br /> <br />
              पवन तनय संकट हरन, मंगल मूरति रूप। <br />
              राम लखन सीता सहित, हृदय बसहु सुर भूप।।
      </p>
      <div class="container text-center"> 
             <h5 class="text-body-tertiary my-5">अन्य आरती व मंत्र</h5>
             <ul>
             <Link to="/aarti/hanumanaarti"> <li className='mylinks'>हनुमान जी की आरती</li> </Link> <br />
             <Link to="/aarti/ramaarti"> <li className='mylinks'>श्री राम की आरती</li> </Link> <br />
             <Link to="/aarti/ramstuti"> <li className='mylinks'>श्री राम स्तुति</li> </Link> <br />
             </ul>
    </div>
    </div>
  );
};
  
export default Chalisa;


