import React from "react";
import logo from "../images/h3.jpg";
import logo2 from "../images/p1.jpg";
import logo3 from "../images/p3.jpg";
import Route from "./Route";
import Slider from "react-slick";

const Main = () => {
  const settings = {
    dots: false,
      infinite: true,
      fade: true,
      arrows: false,
      slidesToShow: 1,
      slidesToScroll: 1,
      autoplay: true,
      autoplaySpeed: 2000
  };
  return (
    <>
      <div class="conatiner-fluid">
      <Slider {...settings}>
          <div style={{width: "90%"}}>
            <img className="main_img" style={{width: "100%"}} src={logo} alt="pic" />
          </div>
          <div style={{width: "90%"}}>
          <img className="main_img" style={{width: "100%"}} src={logo2} alt="pic" />
          </div>
          <div style={{width: "90%"}}>
          <img className="main_img" style={{width: "100%"}} src={logo3} alt="pic" />
          </div>
        </Slider>
        <div className="main_text">
          <h2 class="text-center mycolor py-4">
            ।। जय सीताराम जी ।। जय श्री मेहंदीपुर बालाजी ।।
          </h2>
          <p align="justify" class="text-light-emphasis">
            फतेहाबाद जिले के टोहाना तहसील में स्थित  
            <span class="text-danger"> "श्री संकट मोचन बालाजी टोहाना धाम" </span>
             श्री गुरुदेव / श्री मेहंदीपुर बालाजी / माँ कालका / श्री महामाया माँ
            बाला सुंदरी व अन्य पवित्र शक्तियों से संचलित दरबार हजारों लोगों के
            आस्था का केंद्र है | यहां पर दूर-दराज से भगतजन चलकर आते हैं व श्री
            बालाजी महाराज का आशीर्वाद प्राप्त करते हैं | यहाँ कि मुख्य विशेषता यह
            है कि यहाँ किसी गरीब / अमीर व किसी जाति / धर्म इतिहास में किसी पारकर का
            भेदभाव नहीं किया जाता है व दरबार के दिन (मंगलवार व शनिवार) बाबा का
            अटुट लंगर चलता है | <br /> <br />
            इस वेबसाइट का मुख्य उद्देश्य ये है कि कुछ लोग ये सोचते हैं कि श्री
            संकट मोचन बालाजी टोहाना धाम मैं सिर्फ संकट वाले लोग / भगत जिन्हे
            भूत, प्रेत, चोंकी, बंधन एवं कोई विशेष रोग होता है, वो ही आते है लेकिन
            ये बात केवल मिथ्या है, क्योंकि श्री बालाजी महाराज तो भगत सिरोमणि है
            और सबका कल्याण करने वाले हैं | वो अपने भगतों को मन चाहा फल देने वाले
            और परम कल्याण रूप है इसीलिये सभी भगत श्री संकट मोचन बालाजी धाम आ
            सकते हैं |
            <br /> <br />
            जैसा कि हम सभी जानते हैं कि इस कलयुग में प्राणि किसी न किसी संकट से
            घिरा हुआ है | वो संकट मानसिक भी हो सकता है, शरीरिक भी हो सकता है,
            आर्थिक भी हो सकता है, व्यापार संबंधित या कोई अन्य हो सकता है | उक्त
            सभी प्रकार के कष्ट का निवारण श्री बालाजी महाराज के आशीर्वाद से श्री
            बंता राम भगत जी द्वारा उपायों इत्यादि के माध्यम किया जाता है | इस
            दरबार में आते ही श्री बालाजी महाराज की कृपा से सारी परेशानियां दूर
            भाग जाती है और अपार सुख का अनुभव होता है | <br /> <br />

            तो आज ही प्लान बनाएं श्री संकट मोचन बालाजी टोहाना धाम के अलौकिक एवं
            सुखदायी दर्शन का अपने घर, कार्यालय या मंदिर में जा कर श्री हनुमान जी
            महाराज से अनुग्रह करें कि श्री बालाजी महाराज आपके अपने दरबार बुलाए,
            क्योंकि बिना उनकी इच्छा के कोई उनके दरबार नहीं पहुंच सकता |
            <br /> <br/> 
            <span class="d-flex justify-content-center"> || जय गुरुदेव || </span> <br />
            <span class="d-flex justify-content-center text-center">
            || जय श्री बालाजी महाराज  || <br /> || जय माँ कालका ||  <br /> || जय माँ बाला सुंदरी || </span>
          </p>
        </div>
      </div>
      <Route />
    </>
  );
};

export default Main;
