import React from "react";
import Contact from "./Contact";

const Rules = () => {
  return (
    <>
      <div class="conatiner rules bg-light pb-5">
        <h2 class="text-center mycolor pt-5">
          कुछ महत्वपूर्ण नियम:-
        </h2>
        <div className="d-flex justify-content-center">
        <hr class="col-6 col-sm-4 col-md-3 col-lg-3 pb-3" />
        </div>
        <div class="rules_list text-light-emphasis">
          <p align="justify" style={{letterSpacing: "2px"}}>
            जैसा कि हम सभी भक्त जानते है कि भक्त शिरोमणि श्री बाला जी महाराज
            नियम या कायदा नही देखते है। श्री बालाजी महाराज जी हमारे मन का भाव
            देखते है। जैसा कि आजकल हमे फेसबुक एवं अन्य वेबसाइट पे देखने को मिलता
            है कि ये करना चाहिए, ये नही करना चाहिए? भक्तो इन सब में ध्यान न देकर
            आप बस अपने मन में श्री राम जी का नाम लीजिये। और श्री बालाजी महाराज
            के दरवार में आ जाइए। वहां पे सारे संकट पल भर में कट जाते है जी।
            हमारे श्री बाला जी महाराज जी बड़े ही दयालु है। उनके लिए सारे भक्तगण
            एक समान है चाहे वो पिछले 50 साल से बालाजी धाम आ रहा हो या पहली बार
            आया हो। फिर भी कुछ निम्न नियम है आप से विनम्र निवेदन है अगर आपको सही
            लगे तो कृपया इनका पालन अवश्य कीजिये जी।
            <br /> <br />
            श्री बालाजी महाराज जी के दर्शन हेतु जाने वाले यात्रियों एवं
            श्रध्दालुओ को निम्नलिखित नियमो का पालन करना चाहिए ..
          </p>
          <ol>
            <li>
              सवेरे तथा शाम के समय सभी यात्रियो को श्री बालाजी महाराज जी के
              सम्मुख उपस्थित होना चाहिए तथा ध्यानपूर्वक भक्तिभाव से हरि कीर्तन व
              भजन सुनने और गाने चाहिए।
            </li>
            <li>
              समस्त श्रध्दालुओ को वहाँ रहते हुए दूसरे यात्रियो व श्रध्दालुओ के
              साथ स्नेह्पूर्ण व सहानभूति का व्यवहार रखना चाहिए।
            </li>
            <li>
              आरती के बाद सभी श्रध्दालुओ को श्री महन्त जी तथा अन्य भक्तो के साथ
              मिलकर दैनिक प्रार्थना-वन्दना करनी चाहिए।
            </li>
            <li>
              यहाँ आकर धैर्यपूर्वक रहना चाहिए तथा व्यर्थ का वार्तालाप नही करना
              चाहिए और श्रध्दापूर्वक प्रसाद ग्रहण करना चाहिए।
            </li>
            <li>
              जिन रोगियो को मार पड़ती हुई हो उनके लिए आस-पास की जगह खाली छोड
              देनी चाहिए तथा समस्त उपस्थित भक्तो को जयकारो व भजनो के अलावा कोई
              भी वर्तालाप नही करना चाहिए।
            </li>
            <li>
              सभी श्रध्दालुओ को श्री प्रेतराज सरकार जी के दरबार मे जाना चहिए और
              श्री महन्त जी के आदेश का पालन करना चाहिए और पूजा में व्यवधान नही
              डालना चाहिए।
            </li>
            <li>
              आरती सम्पूर्ण होने पर श्रध्दालुओ को ध्यानपूर्वक एवं श्रद्धा-भाव से
              श्री बालाजी की स्तुति प्रेम पूर्वक गानी चाहिए। श्रध्दालुओ को अपने
              हाथ से कोई भी पूजन सामग्री छूनी नही चाहिए।
            </li>
          </ol>
        </div>
      </div>
    </>
  );
};

export default Rules;
